sampleCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 0.2 0)
    (0 0.2 0)

    (0 0 0.1)
    (1 0 0.1)
    (1 0.2 0.1)
    (0 0.2 0.1)

    (0 0.8 0)
    (1 0.8 0)
    (1 1.0 0)
    (0 1.0 0)

    (0 0.8 0.1)
    (1 0.8 0.1)
    (1 1.0 0.1)
    (0 1.0 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)   (40  8 1) simpleGrading (1 1 1)
    hex (3 2 9 8 7 6 13 12) (40 24 1) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) (40 8 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (8 12 15 11)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (10 14 13 9)
            (11 15 14 10)
            (3 7 12 8)
            (0 4 7 3)
            (1 5 4 0)
            (9 13 2 6)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (3 8 9 2)
            (8 11 10 9)
            (4 5 6 7)
            (7 6 13 12)
            (12 13 14 15)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
