sampleCase/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         50;

deltaT          0.01;

writeControl    runTime;

writeInterval   0.5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

libs (sampling);

functions
{
    probeTemperature
    {
        type            probes;
        libs            (sampling);
        name            probes;
        writeControl    timeStep;
        timeInterval    1;
        fields          (T);
        probeLocations
        (
            (0.025 0.025 0.005)
        );
    }

    inletTemperature
    {
        name    inlet;
        fields  (T);

        operation areaAverage;
        #includeEtc "caseDicts/postProcessing/surfaceFieldValue/patch.cfg"
    }
}
// ************************************************************************* //
